// Задача 18
// Сортування масиву структур

// Написати програму на мові С++ для розв'язання завдання згідно з варіантом.
// Завдання реалізувати за допомогою структур, описати структуру, описати функції
// введення та виведення даних в табличному форматі.
// Варіант завдання відповідає номеру по списку студента в журналі.

// Storage: Інвентарний номер, Назва товару, Вага товару, Ціна, Кількість.

// Написати програму на мові С++ для розв'язання завдання згідно
// з варіантом. Варіант завдання взяти із завдання на практику №16.
// При виконання завдання необхідно створити масив структури відповідно до варіанту,
// ввести не менше ніж 5 записів, організувати діалог вибору інформації для виведення.
// Для введення та виведення інформації необхідно написати відповідні функції.

// Написати програму на мові С++ для розв'язання завдання згідно з варіантом.
// Варіант завдання взяти із завдання на практику №16.
// При виконання завдання необхідно створити масив структури відповідно до варіанту,
// ввести не менше ніж 5 записів, організувати діалог вибору параметру
// (за зростанням або за спаданням) для сортування масиву структури.
// Для введення та виведення інформації, а також для організації
// сортування необхідно написати відповідні функції.

#include <iostream>

using namespace std;

int main(){
    setlocale(LC_ALL, "Russian");

    int choice, rerun;

    struct storage{
        int inv_num = 0;
        string name = "";
        int weight = 0;
        int price = 0;
        int amount = 0;
    };

    cout << "Ввеiть кiлькiсть записiв: ";
    int n;
    cin >> n;

    storage *s = new storage[n];

    for (int i = 0; i < n ; ++i){
        cout << endl << "Інвентарний номер " << i+1 << "-го товару: ";
        cin >> s[i].inv_num;

        cout << "Назва " << i+1 << "-го товару: ";
        cin >> s[i].name;

        cout << "Вага " << i+1 << "-го товару: ";
        cin >> s[i].weight;

        cout << "Ціна " << i+1 << "-го товару: ";
        cin >> s[i].price;

        cout << "Кількість " << i+1 << "-го товару: ";
        cin >> s[i].amount;
    }

    cout << endl << "Виведення даних в табличному форматі: " << endl;

    for (int i = 0; i < n ; ++i){
        cout << "===========================================" << endl;
        cout << "Товар №" << i+1 << endl << endl;
        cout << "Інвентарний номер: " << s[i].inv_num << endl;
        cout << "Назва: " << s[i].name << endl;
        cout << "Вага: " << s[i].weight << endl;
        cout << "Ціна: " << s[i].price << endl;
        cout << "Кількість: " << s[i].amount << endl;
    }

    cout << endl << "Виберіть параметр сортування даних:" << endl;
    cout << "Щоб сортувати дані по інвентароному номеру, введіть 1" << endl;
    cout << "Щоб сортувати дані по назві, введіть 2" << endl;
    cout << "Щоб сортувати дані по вазі, введіть 3" << endl;
    cout << "Щоб сортувати дані по ціні, введіть 4" << endl;
    cout << "Щоб сортувати дані по кількості, введіть 5" << endl;

    cin >> choice;


    if (choice == 1) {
        // сортування по інвентарному номеру
        for (int i = 0; i < n - 1; ++i) {
            int imin = i;
            for (int j = i + 1; j < n; ++j)
                if (s[j].inv_num < s[imin].inv_num) imin = j;
            int temp = s[i].inv_num;
            s[i].inv_num = s[imin].inv_num;
            s[imin].inv_num = temp;
        }

        cout << endl << endl << "Виведення сортованих даних по інвентарному номеру в табличному форматі: " << endl;

        for (int i = 0; i < n; ++i) {
            cout << "===========================================" << endl;
            // cout << "Товар №" << i+1 << endl << endl; я хз як сортувати номер товару.
            cout << "Інвентарний номер: " << s[i].inv_num << endl;
            cout << "Назва: " << s[i].name << endl;
            cout << "Вага: " << s[i].weight << endl;
            cout << "Ціна: " << s[i].price << endl;
            cout << "Кількість: " << s[i].amount << endl;
        }
    } else if (choice == 2){
        //
    }


    return 0;
}
