#include <iostream>
#include <math.h>

// Задача 3 - Цикл з параметром

//	Необхідно обчислити значення yі=f(z,хі), де параметр циклу z змінюються
//	від початкового до кінцевого значення з постійним кроком z, а змінна хі(і=1,2…,n)
//	є елементом одновимірного масиву.

// Параметр циклу з регулярною зміною аргумента:
// Параметр циклу: q
// Початкове значення: 2.8
// Кінцеве значення: 5.4
// Крок: 1.13

// Параметр циклу з індексною змінною:
// Позначення індекса: m
// Номер індекса: 1, 2, 3
// Значення індексної змінної: -1.85, 2.39, 3.65

// zm = cm + e^m - q
//			   1- m

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");
    double res, q, z;
    int m[3] = {-1.85, 2.39, 3.65};
    int c, e, i;

    for(int i = 1; i <= 3; i++) {
        double result = 0;
        for(double q = 2.8; q < 5.4; q = q + 1.3) {
            result += (pow( 2.71828, m[i]) - q) / (1 - m[i]);
        }
        cout << result << endl;
    }

    return 0;
}